#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_codeartifact_repository.pip_store has been deleted
  - resource "aws_codeartifact_repository" "pip_store" {
        id                    = "arn:aws:codeartifact:eu-west-1:613963413230:repository/pltest-artifact/pltest-private-python"
      - repository            = "pltest-private-python" -> null
        tags                  = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_codeartifact_repository.upstream has been deleted
  - resource "aws_codeartifact_repository" "upstream" {
        id                    = "arn:aws:codeartifact:eu-west-1:613963413230:repository/pltest-artifact/pltest-pip"
      - repository            = "pltest-pip" -> null
        tags                  = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.github_codeartifact will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "github_codeartifact" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "codeartifact:GetAuthorizationToken",
              + "codeartifact:GetRepositoryEndpoint",
              + "codeartifact:ReadFromRepository",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "CodeartifactActions"
        }
      + statement {
          + actions   = [
              + "sts:GetServiceBearerToken",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "GetTokenforcodeartifact"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "codeartifact.amazonaws.com",
                ]
              + variable = "sts:AWSServiceName"
            }
        }
    }

  # aws_codeartifact_repository.pip_store will be created
  + resource "aws_codeartifact_repository" "pip_store" {
      + administrator_account = (known after apply)
      + arn                   = (known after apply)
      + domain                = "pltest-artifact"
      + domain_owner          = (known after apply)
      + id                    = (known after apply)
      + repository            = "pltest-private-python"
      + tags_all              = {
          + "Project" = "demo-github"
        }

      + upstream {
          + repository_name = "pltest-public-pip"
        }
    }

  # aws_codeartifact_repository.pip_usage will be created
  + resource "aws_codeartifact_repository" "pip_usage" {
      + administrator_account = (known after apply)
      + arn                   = (known after apply)
      + domain                = "pltest-artifact"
      + domain_owner          = (known after apply)
      + id                    = (known after apply)
      + repository            = "pltest-pip-store"
      + tags_all              = {
          + "Project" = "demo-github"
        }

      + upstream {
          + repository_name = "pltest-private-python"
        }
    }

  # aws_codeartifact_repository.upstream will be created
  + resource "aws_codeartifact_repository" "upstream" {
      + administrator_account = (known after apply)
      + arn                   = (known after apply)
      + domain                = "pltest-artifact"
      + domain_owner          = (known after apply)
      + id                    = (known after apply)
      + repository            = "pltest-public-pip"
      + tags_all              = {
          + "Project" = "demo-github"
        }

      + external_connections {
          + external_connection_name = "public:pypi"
          + package_format           = (known after apply)
          + status                   = (known after apply)
        }
    }

  # aws_iam_policy.github_codeartifact will be updated in-place
  ~ resource "aws_iam_policy" "github_codeartifact" {
        id          = "arn:aws:iam::613963413230:policy/oidc_codeartifact_readonly"
        name        = "oidc_codeartifact_readonly"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "codeartifact:ReadFromRepository",
                          - "codeartifact:GetRepositoryEndpoint",
                          - "codeartifact:GetAuthorizationToken",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "CodeartifactActions"
                    },
                  - {
                      - Action   = "sts:GetServiceBearerToken"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "GetTokenforcodeartifact"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

```

</details>

*Pusher: @pglagerweij, Action: `pull_request`, Workflow: `terraform-pipeline-pr`*